#include<iostream>
using namespace std;

//此氣泡排序並非最佳寫法

//由小排到大
int main(){
    int N=5;
    int L[N]={1, 5, 3, 4, 2}; //這裡先給定陣列的值，若不會輸入請看《5-1_一維陣列_1DArray》的範例四、五

    //開始排序，氣泡排序，時間複雜度為N平方(N**2)
    for (int i=0 ; i<N-1 ; i++){ //遍歷L陣列
        for (int j=0 ; j<N-1 ; j++){ //遍歷L陣列
            if (L[j]>L[j+1]){ //如果現在這一項比下一項大，就互換數值，因為現在要由小排到大，「任一項都要比它的下一項小」
                //互換L[j+1]跟L[j]的值
                int temp=L[j+1]; //先建立一個變數來儲存L[j+1]
                //我們已經有了L[j+1]的備份(temp)，可以放心修改L[j+1]的值
                L[j+1] = L[j]; 
                L[j] = temp;
            }
        }
    }
    for (int i=0 ; i<N ; i++) cout << L[i] << " "; //輸出: 1 2 3 4 5
}

/*
氣泡排序邏輯，以{1, 5, 3, 4, 2}為例


*/

//Created by B.J.Wang 2025/10/16